src/cf/InformationRegisters/КартаДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КартаДня</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатПоОкончании</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщийРезультат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметГадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметГадания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Перевернутая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КартаДня/Forms/ФормаЗаписи/Ext/Form/Module.bsl
Процедура ПосчитатьПроцент()
	Если НЕ Запись.РезультатНаНачало = Запись.РезультатПоОкончании Тогда
		Рез = Окр((Запись.РезультатПоОкончании - Запись.РезультатНаНачало)/Запись.РезультатНаНачало*100, 2);
		Если Рез > 0 Тогда
			Элементы.Декорация1.Заголовок = "Рост " + Рез + "%";
			Если НЕ Запись.ОбщийРезультат = Элементы.Декорация1.Заголовок Тогда
				Запись.ОбщийРезультат = Элементы.Декорация1.Заголовок;
			КонецЕсли;			
		ИначеЕсли Рез < 0 Тогда
			Элементы.Декорация1.Заголовок = "Падение " + Рез + "%";
			Если НЕ Запись.ОбщийРезультат = Элементы.Декорация1.Заголовок Тогда
				Запись.ОбщийРезультат = Элементы.Декорация1.Заголовок;
			КонецЕсли;
		Иначе
			Элементы.Декорация1.Заголовок = "0";
			Если НЕ Запись.ОбщийРезультат = Элементы.Декорация1.Заголовок Тогда
				Запись.ОбщийРезультат = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ПосчитатьПроцент();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РезультатНаНачалоПриИзмененииНаСервере()
	ПосчитатьПроцент();
КонецПроцедуры

&НаКлиенте
Процедура РезультатНаНачалоПриИзменении(Элемент)
	РезультатНаНачалоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РезультатПоОкончанииПриИзмененииНаСервере()
	ПосчитатьПроцент();
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоОкончанииПриИзменении(Элемент)
	РезультатПоОкончанииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоНовый = Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи) ; 
    Копирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	Если Копирование И НЕ Параметры.ЗначениеКопирования.Период = '00010101' Тогда
		Запись.Период = НачалоДня(Параметры.ЗначениеКопирования.Период + 86400);
		Запись.Карта = Неопределено;
		Запись.Перевернутая = Ложь;  
		МЗ = РегистрыСведений.КартаДня.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Параметры.ЗначениеКопирования);
		МЗ.Прочитать();
		Запись.РезультатНаНачало = МЗ.РезультатПоОкончании;
		Запись.РезультатПоОкончании = 0;
		Запись.ЗначениеКарты = "";
		Запись.ОбщийРезультат = "";
	КонецЕсли;
	
КонецПроцедуры
